#include <stdio.h>

int main() {
    // แสดงผลตัวอักษร 'a' ตามด้วยเลขทศนิยม 3 ตำแหน่งและเว้นช่องว่าง 6 ตัว
    printf("a=%6.3f%%\n", 0.617);

    // แสดงผลตัวอักษร 'b' ตามด้วยเลขจำนวนเต็ม 4 หลัก (เติม 0 ข้างหน้า) และเครื่องหมาย %
    printf("b=%4d%%\n", 25);

    // แสดงผลตัวอักษร 'c' ตามด้วยเลขทศนิยม 3 ตำแหน่ง โดยเว้นช่องว่าง 6 ตัวทางซ้าย
    printf("c  =%6.3f%%\n", 19);

    // แสดงผลตัวอักษร 'd' ตามด้วยเลขจำนวนเต็ม 2 หลัก โดยจัดชิดซ้ายและมีเครื่องหมาย %
    printf("d =%-2d%%", 9);

    // แสดงผลตัวอักษร 'e' ตามด้วยเลขทศนิยม 3 ตำแหน่ง โดยเว้นช่องว่าง 7 ตัวทางซ้าย
    printf("e=%7.3f%%\n", 124.555);

    // แสดงผลตัวอักษร 'f' ตามด้วยเลขทศนิยม 3 ตำแหน่ง โดยเว้นช่องว่าง 5 ตัวทางซ้าย
    printf("f=%5.3f%%\n", 0.001);

    return 0; // จบโปรแกรมโดยส่งค่ากลับ 0
}
